DylanMissu/Workshop11-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Workshop11/Logger_Zero
# ---------------------------------------
Workshop11_Logger_Zero.name=Workshop11_Logger_Zero
Workshop11_Logger_Zero.vid.0=0x2341
Workshop11_Logger_Zero.pid.0=0xff4d
Workshop11_Logger_Zero.vid.1=0x2341
Workshop11_Logger_Zero.pid.1=0xff4d
Workshop11_Logger_Zero.upload.tool=bossac
Workshop11_Logger_Zero.upload.protocol=sam-ba
Workshop11_Logger_Zero.upload.maximum_size=262144
Workshop11_Logger_Zero.upload.use_1200bps_touch=true
Workshop11_Logger_Zero.upload.wait_for_upload_port=true
Workshop11_Logger_Zero.upload.native_usb=true
Workshop11_Logger_Zero.build.mcu=cortex-m0plus
Workshop11_Logger_Zero.build.f_cpu=48000000L
Workshop11_Logger_Zero.build.usb_product="Workshop11_Logger_Zero"
Workshop11_Logger_Zero.build.usb_manufacturer="Workshop11"
Workshop11_Logger_Zero.build.board=Workshop11_Logger_Zero
Workshop11_Logger_Zero.build.core=arduino
Workshop11_Logger_Zero.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
Workshop11_Logger_Zero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Workshop11_Logger_Zero.build.openocdscript=
Workshop11_Logger_Zero.build.variant=logger_zero
Workshop11_Logger_Zero.build.variant_system_lib=
Workshop11_Logger_Zero.build.vid=0x2341
Workshop11_Logger_Zero.build.pid=0x804d
Workshop11_Logger_Zero.bootloader.tool=openocd
Workshop11_Logger_Zero.bootloader.file=
